# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.


l1=[1,2,3,'list elem',[1,2,3,'dsfads']]

for el in l1:
    print (type(el))
